{
  "Projects": [
    {
      "show": true,
      "title": "TestNexus",
      "desc": [
        "TestNexus is a comprehensive unified testing framework designed to streamline all aspects of software quality assurance. Supporting UI, API, performance, contract, end-to-end, and integration testing, it provides a single platform for managing your entire test suite with an intuitive dark-themed interface.",
        "Built with containerization at its core, TestNexus spins up isolated Docker containers for each test run, ensuring clean and reproducible test environments. After execution, it automatically exports detailed reports and terminates containers to optimize resource usage - no orphaned processes or wasted compute.",
        "The framework features real-time console output, organized test suite management, and comprehensive reporting with archived results. Whether you're running a quick API validation or a full regression suite, TestNexus handles the infrastructure so you can focus on writing better tests."
      ],
      "year": "2025",
      "preview": "",
      "code": "https://github.com/Timi953/unified-testing-framework.git",
      "thumbnail": "/image/projects/web/testnexus/testnexus-thumbnail.png",
      "images": [
        "/image/projects/web/testnexus/testnexus-1.png"
      ],
      "tech": [
        "Docker",
        "Python",
        "Pytest",
        "Selenium",
        "Playwright",
        "k6",
        "API Testing",
        "CI/CD"
      ],
      "slug": "testnexus",
      "category": [1, 2]
    },
    {
      "show": true,
      "title": "RemodelSpark",
      "desc": [
        "RemodelSpark is an AI-powered real estate visualization platform that transforms property photos into stunning remodeling previews. Powered by NanoBanana's advanced image generation technology, it enables homeowners, real estate agents, and designers to instantly visualize renovation possibilities.",
        "The platform offers three distinct remodeling categories: Interior Design for reimagining living spaces, Facade transformation for exterior makeovers, and Landscaping for outdoor beautification. Users simply upload a photo, select their preferred style and remodeling type, and watch as AI generates photorealistic previews of the transformed space.",
        "With an intuitive interface and rapid generation capabilities, RemodelSpark bridges the gap between imagination and visualization, helping users make informed decisions about property improvements before committing to costly renovations."
      ],
      "year": "2025",
      "preview": "https://remodelspark.com",
      "code": "",
      "thumbnail": "/image/projects/web/remodelspark/remodelspark-thumbnail.png",
      "images": [
        "/image/projects/web/remodelspark/remodelspark-1.png"
      ],
      "tech": [
        "AI Image Generation",
        "NanoBanana",
        "React",
        "Next.js",
        "Tailwind CSS",
        "Cloud Infrastructure"
      ],
      "slug": "remodelspark",
      "category": [1, 2]
    }
  ]
}
